<template>
	<div class="demo-container">
		<v3-row>
			<v3-col>
				<h3>基本用法：</h3>
			</v3-col>
		</v3-row>
		<v3-row>
			<v3-col>
				<v3-button type="primary" @click="state.showDialog1 = true"
					>打开弹窗</v3-button
				>
				<v3-dialog
					v-model="state.showDialog1"
					:title="'基本用法'"
					:headerActions="state.headerActions1"
				>
					<div class="dialog-content-1">
						天下之患，最不可为者，名为治平无事，而其实有不测之忧，坐观其变，而不为之所，则恐至于不可救，起而强为之则天下狃于治平之安，而不吾信
						——《苏东坡 晁错论》
						大汉开国元勋淮阴侯韩信死于长乐钟室，年仅三十五岁。随后，韩信三族被诛，数千无辜，血染长安，哭号之声，传荡千古，当是时，寒风凛冽，长空飘雪，长安满城人尽嗟叹，无不悲怆，皆言淮阴侯一饭千金，不忘漂母；解衣推食，宁负汉皇？萧何一言便强入贺，欲谋逆者怎会坦率如斯？是侯不负汉，而汉忍于负侯，侯之死，冤乎哉！
						不日，蒯通被带到，高祖亲自审问。「当日汝与韩信之言，究竟为何？」
						蒯通道「吾相韩信，言其面不过封侯，背则贵不可言。因说之背汉自立，则可三分天下也。」
						高祖又问：「然信有何言？」 蒯通长叹一声道：
					</div>
				</v3-dialog>
			</v3-col>
		</v3-row>

		<v3-row>
			<v3-col>
				<h3>可自定义头部的操作按钮组：</h3>
			</v3-col>
		</v3-row>
		<v3-row>
			<v3-col>
				<v3-button type="primary" @click="state.showDialog2 = true"
					>打开弹窗</v3-button
				>
				<v3-dialog
					v-model="state.showDialog2"
					:headerActions="state.headerActions2"
				>
					<div class="dialog-content-2">
						<h4 style="margin: 0; margin-bottom: 12px">姓名：</h4>
						<v3-input></v3-input>
						<h4 style="margin: 20px 0;">性别：</h4>
						<v3-radio-group v-model="state.radioValue2">
							<v3-radio label="male">男</v3-radio>
							<v3-radio label="female">女</v3-radio>
						</v3-radio-group>
						<h4 style="margin: 20px 0;">工作地：</h4>
						<v3-select v-model="state.selectValue2">
							<v3-select-option
								v-for="v in state.selectOptions2"
								:key="v.value"
								:value="v.value"
								:label="v.label"
								:disabled="v.disabled"
							></v3-select-option>
						</v3-select>
					</div>
				</v3-dialog>
			</v3-col>
		</v3-row>

		<v3-row>
			<v3-col>
				<h3>可自定义弹窗标题：</h3>
			</v3-col>
		</v3-row>
		<v3-row>
			<v3-col>
				<v3-button type="primary" @click="state.showDialog3 = true"
					>打开弹窗</v3-button
				>
				<v3-dialog v-model="state.showDialog3">
					<template #title>
						<span style="color: rgba(237, 170, 83, 1)">slot 自定义标题</span>
					</template>
					<div class="dialog-content-3">
						天下之患，最不可为者，名为治平无事，而其实有不测之忧，坐观其变，而不为之所，则恐至于不可救，起而强为之则天下狃于治平之安，而不吾信
						——《苏东坡 晁错论》
						大汉开国元勋淮阴侯韩信死于长乐钟室，年仅三十五岁。随后，韩信三族被诛，数千无辜，血染长安，哭号之声，传荡千古，当是时，寒风凛冽，长空飘雪，长安满城人尽嗟叹，无不悲怆，皆言淮阴侯一饭千金，不忘漂母；解衣推食，宁负汉皇？萧何一言便强入贺，欲谋逆者怎会坦率如斯？是侯不负汉，而汉忍于负侯，侯之死，冤乎哉！
						不日，蒯通被带到，高祖亲自审问。「当日汝与韩信之言，究竟为何？」
						蒯通道「吾相韩信，言其面不过封侯，背则贵不可言。因说之背汉自立，则可三分天下也。」
						高祖又问：「然信有何言？」 蒯通长叹一声道：
					</div>
				</v3-dialog>
			</v3-col>
		</v3-row>

		<v3-row>
			<v3-col>
				<h3>弹窗内容和底部均可自定义：</h3>
			</v3-col>
		</v3-row>
		<v3-row>
			<v3-col>
				<v3-button type="primary" @click="state.showDialog4 = true"
					>打开弹窗</v3-button
				>
				<v3-dialog
					title="提示"
					width="25%"
					customClass="dialog-4"
					v-model="state.showDialog4"
					:closeOnClickBackdrop="false"
				>
					<div class="dialog-content-4">
						<i class="v3-icon v3-icon-warning-fill"></i>
						<span> 确定要删除吗？ </span>
					</div>
					<template #footer>
						<div class="dialog-footer-4">
							<v3-button type="default" plain @click="state.showDialog4 = false"
								>取消</v3-button
							>
							<v3-button type="primary" @click="handleConfirm4"
								>我知道了</v3-button
							>
						</div>
					</template>
				</v3-dialog>
			</v3-col>
		</v3-row>

		<v3-row>
			<v3-col>
				<h3>全屏的弹窗：</h3>
			</v3-col>
		</v3-row>
		<v3-row>
			<v3-col>
				<v3-button type="primary" @click="state.showDialog5 = true"
					>打开弹窗</v3-button
				>
				<v3-dialog
					fullscreen
					width="50%"
					customClass="dialog-5"
					v-model="state.showDialog5"
				>
					<div class="dialog-content-5">
						1
						每个人都渴望被认可，赞美之于人心，如阳光之于万物。有时，一个善意的赞许，就能给人莫大的信心和鼓励，让人体会到生活的美好。
						前几天，朋友小艾发了条朋友圈，晒出自己周末和男友去踏青的照片，还放上了男友送她的口红。照片里的她眉飞色舞、笑意盈盈，评论区里有人夸她“气色好”，也有人称赞“郎才女貌”。
						可过了一会儿，一位朋友却评论到：“原来你男朋友个子这么矮啊，就送一个口红，这也太拿不出手了吧。”这句话在一众评论里显得十分扎眼。之后，小艾就默默删掉了那条朋友圈，当一切都没发生过。
						后来私下跟小艾提起这事，她摊摊手，表示已经习惯了。那位朋友说话向来如此，那些嘲讽的话犹如一把尖刀插进别人心里，因此大家都和她保持着距离。
						真正有格局的人，深知“大家好才是真的好”，愿意为别人喝彩。也唯有如此，人生之路才会越走越宽。
						2
						妹妹大学毕业后，因为囊中羞涩，选择和同事合租。刚住进去时她总跟我抱怨同事有多奇葩，要么做完饭满地狼藉，要么洗完澡很少收拾。可因为大家都在一个公司，低头不见抬头见，又不好意思撕破脸。
						有一次听她说完后，我反问她：“难道这个同事什么优点都没有吗？”妹妹想了下跟我说：“其实她还是蛮厉害的，上周烧水时突然跳闸了，我不知道怎么办，多亏她及时报修。”过了一会儿，她又说道：“还有一次，我忘了带钥匙，她特意从公司给我送过来。”
						同一个人，用不同的眼光去看，瞬间就不一样。很多时候我们会对身边的人吹毛求疵，可如果一味盯着别人的缺点，生活自然一地鸡毛。只有看到对方的优点，才能舒服相处。
						朋友间如此，爱人间亦如此。越是优秀的人，越容易看到别人的好。 3
						有句话说，良言一句三冬暖，恶语伤人六月寒。说一句话，不过几秒钟的事，却可能会在很多年后仍旧影响着对方。
						有位网友分享过自己的经历，说自己高三时压力大到一度崩溃，没想到有位老师却夸她“很有潜力”。几十年过去了，她依然记得那个老师。也有网友吐槽说：“矫正牙齿前被别人说不要张嘴笑，导致现在还不敢在别人面前笑。”
						把握分寸，是一种难得的智慧。那些能看到别人优点的人，往往懂得把别人放在心上，时刻照顾别人的感受。他们会在一言一语中放低自己的姿态，让别人感受到关心和尊重。
						人与人之间，不过一场以心换心。学会欣赏别人，别人才会欣赏你。对他人适时地赞美，不需要多么高超的说话技巧，比技巧更重要的是真诚。真心实意、以诚相待，永远是人际交往中最基本的准则。
						1
						每个人都渴望被认可，赞美之于人心，如阳光之于万物。有时，一个善意的赞许，就能给人莫大的信心和鼓励，让人体会到生活的美好。
						前几天，朋友小艾发了条朋友圈，晒出自己周末和男友去踏青的照片，还放上了男友送她的口红。照片里的她眉飞色舞、笑意盈盈，评论区里有人夸她“气色好”，也有人称赞“郎才女貌”。
						可过了一会儿，一位朋友却评论到：“原来你男朋友个子这么矮啊，就送一个口红，这也太拿不出手了吧。”这句话在一众评论里显得十分扎眼。之后，小艾就默默删掉了那条朋友圈，当一切都没发生过。
						后来私下跟小艾提起这事，她摊摊手，表示已经习惯了。那位朋友说话向来如此，那些嘲讽的话犹如一把尖刀插进别人心里，因此大家都和她保持着距离。
						真正有格局的人，深知“大家好才是真的好”，愿意为别人喝彩。也唯有如此，人生之路才会越走越宽。
						2
						妹妹大学毕业后，因为囊中羞涩，选择和同事合租。刚住进去时她总跟我抱怨同事有多奇葩，要么做完饭满地狼藉，要么洗完澡很少收拾。可因为大家都在一个公司，低头不见抬头见，又不好意思撕破脸。
						有一次听她说完后，我反问她：“难道这个同事什么优点都没有吗？”妹妹想了下跟我说：“其实她还是蛮厉害的，上周烧水时突然跳闸了，我不知道怎么办，多亏她及时报修。”过了一会儿，她又说道：“还有一次，我忘了带钥匙，她特意从公司给我送过来。”
						同一个人，用不同的眼光去看，瞬间就不一样。很多时候我们会对身边的人吹毛求疵，可如果一味盯着别人的缺点，生活自然一地鸡毛。只有看到对方的优点，才能舒服相处。
						朋友间如此，爱人间亦如此。越是优秀的人，越容易看到别人的好。 3
						有句话说，良言一句三冬暖，恶语伤人六月寒。说一句话，不过几秒钟的事，却可能会在很多年后仍旧影响着对方。
						有位网友分享过自己的经历，说自己高三时压力大到一度崩溃，没想到有位老师却夸她“很有潜力”。几十年过去了，她依然记得那个老师。也有网友吐槽说：“矫正牙齿前被别人说不要张嘴笑，导致现在还不敢在别人面前笑。”
						把握分寸，是一种难得的智慧。那些能看到别人优点的人，往往懂得把别人放在心上，时刻照顾别人的感受。他们会在一言一语中放低自己的姿态，让别人感受到关心和尊重。
						人与人之间，不过一场以心换心。学会欣赏别人，别人才会欣赏你。对他人适时地赞美，不需要多么高超的说话技巧，比技巧更重要的是真诚。真心实意、以诚相待，永远是人际交往中最基本的准则。
						1
						每个人都渴望被认可，赞美之于人心，如阳光之于万物。有时，一个善意的赞许，就能给人莫大的信心和鼓励，让人体会到生活的美好。
						前几天，朋友小艾发了条朋友圈，晒出自己周末和男友去踏青的照片，还放上了男友送她的口红。照片里的她眉飞色舞、笑意盈盈，评论区里有人夸她“气色好”，也有人称赞“郎才女貌”。
						可过了一会儿，一位朋友却评论到：“原来你男朋友个子这么矮啊，就送一个口红，这也太拿不出手了吧。”这句话在一众评论里显得十分扎眼。之后，小艾就默默删掉了那条朋友圈，当一切都没发生过。
						后来私下跟小艾提起这事，她摊摊手，表示已经习惯了。那位朋友说话向来如此，那些嘲讽的话犹如一把尖刀插进别人心里，因此大家都和她保持着距离。
						真正有格局的人，深知“大家好才是真的好”，愿意为别人喝彩。也唯有如此，人生之路才会越走越宽。
						2
						妹妹大学毕业后，因为囊中羞涩，选择和同事合租。刚住进去时她总跟我抱怨同事有多奇葩，要么做完饭满地狼藉，要么洗完澡很少收拾。可因为大家都在一个公司，低头不见抬头见，又不好意思撕破脸。
						有一次听她说完后，我反问她：“难道这个同事什么优点都没有吗？”妹妹想了下跟我说：“其实她还是蛮厉害的，上周烧水时突然跳闸了，我不知道怎么办，多亏她及时报修。”过了一会儿，她又说道：“还有一次，我忘了带钥匙，她特意从公司给我送过来。”
						同一个人，用不同的眼光去看，瞬间就不一样。很多时候我们会对身边的人吹毛求疵，可如果一味盯着别人的缺点，生活自然一地鸡毛。只有看到对方的优点，才能舒服相处。
						朋友间如此，爱人间亦如此。越是优秀的人，越容易看到别人的好。 3
						有句话说，良言一句三冬暖，恶语伤人六月寒。说一句话，不过几秒钟的事，却可能会在很多年后仍旧影响着对方。
						有位网友分享过自己的经历，说自己高三时压力大到一度崩溃，没想到有位老师却夸她“很有潜力”。几十年过去了，她依然记得那个老师。也有网友吐槽说：“矫正牙齿前被别人说不要张嘴笑，导致现在还不敢在别人面前笑。”
						把握分寸，是一种难得的智慧。那些能看到别人优点的人，往往懂得把别人放在心上，时刻照顾别人的感受。他们会在一言一语中放低自己的姿态，让别人感受到关心和尊重。
						人与人之间，不过一场以心换心。学会欣赏别人，别人才会欣赏你。对他人适时地赞美，不需要多么高超的说话技巧，比技巧更重要的是真诚。真心实意、以诚相待，永远是人际交往中最基本的准则。
						1
						每个人都渴望被认可，赞美之于人心，如阳光之于万物。有时，一个善意的赞许，就能给人莫大的信心和鼓励，让人体会到生活的美好。
						前几天，朋友小艾发了条朋友圈，晒出自己周末和男友去踏青的照片，还放上了男友送她的口红。照片里的她眉飞色舞、笑意盈盈，评论区里有人夸她“气色好”，也有人称赞“郎才女貌”。
						可过了一会儿，一位朋友却评论到：“原来你男朋友个子这么矮啊，就送一个口红，这也太拿不出手了吧。”这句话在一众评论里显得十分扎眼。之后，小艾就默默删掉了那条朋友圈，当一切都没发生过。
						后来私下跟小艾提起这事，她摊摊手，表示已经习惯了。那位朋友说话向来如此，那些嘲讽的话犹如一把尖刀插进别人心里，因此大家都和她保持着距离。
						真正有格局的人，深知“大家好才是真的好”，愿意为别人喝彩。也唯有如此，人生之路才会越走越宽。
						2
						妹妹大学毕业后，因为囊中羞涩，选择和同事合租。刚住进去时她总跟我抱怨同事有多奇葩，要么做完饭满地狼藉，要么洗完澡很少收拾。可因为大家都在一个公司，低头不见抬头见，又不好意思撕破脸。
						有一次听她说完后，我反问她：“难道这个同事什么优点都没有吗？”妹妹想了下跟我说：“其实她还是蛮厉害的，上周烧水时突然跳闸了，我不知道怎么办，多亏她及时报修。”过了一会儿，她又说道：“还有一次，我忘了带钥匙，她特意从公司给我送过来。”
						同一个人，用不同的眼光去看，瞬间就不一样。很多时候我们会对身边的人吹毛求疵，可如果一味盯着别人的缺点，生活自然一地鸡毛。只有看到对方的优点，才能舒服相处。
						朋友间如此，爱人间亦如此。越是优秀的人，越容易看到别人的好。 3
						有句话说，良言一句三冬暖，恶语伤人六月寒。说一句话，不过几秒钟的事，却可能会在很多年后仍旧影响着对方。
						有位网友分享过自己的经历，说自己高三时压力大到一度崩溃，没想到有位老师却夸她“很有潜力”。几十年过去了，她依然记得那个老师。也有网友吐槽说：“矫正牙齿前被别人说不要张嘴笑，导致现在还不敢在别人面前笑。”
						把握分寸，是一种难得的智慧。那些能看到别人优点的人，往往懂得把别人放在心上，时刻照顾别人的感受。他们会在一言一语中放低自己的姿态，让别人感受到关心和尊重。
						人与人之间，不过一场以心换心。学会欣赏别人，别人才会欣赏你。对他人适时地赞美，不需要多么高超的说话技巧，比技巧更重要的是真诚。真心实意、以诚相待，永远是人际交往中最基本的准则。
						1
						每个人都渴望被认可，赞美之于人心，如阳光之于万物。有时，一个善意的赞许，就能给人莫大的信心和鼓励，让人体会到生活的美好。
						前几天，朋友小艾发了条朋友圈，晒出自己周末和男友去踏青的照片，还放上了男友送她的口红。照片里的她眉飞色舞、笑意盈盈，评论区里有人夸她“气色好”，也有人称赞“郎才女貌”。
						可过了一会儿，一位朋友却评论到：“原来你男朋友个子这么矮啊，就送一个口红，这也太拿不出手了吧。”这句话在一众评论里显得十分扎眼。之后，小艾就默默删掉了那条朋友圈，当一切都没发生过。
						后来私下跟小艾提起这事，她摊摊手，表示已经习惯了。那位朋友说话向来如此，那些嘲讽的话犹如一把尖刀插进别人心里，因此大家都和她保持着距离。
						真正有格局的人，深知“大家好才是真的好”，愿意为别人喝彩。也唯有如此，人生之路才会越走越宽。
						2
						妹妹大学毕业后，因为囊中羞涩，选择和同事合租。刚住进去时她总跟我抱怨同事有多奇葩，要么做完饭满地狼藉，要么洗完澡很少收拾。可因为大家都在一个公司，低头不见抬头见，又不好意思撕破脸。
						有一次听她说完后，我反问她：“难道这个同事什么优点都没有吗？”妹妹想了下跟我说：“其实她还是蛮厉害的，上周烧水时突然跳闸了，我不知道怎么办，多亏她及时报修。”过了一会儿，她又说道：“还有一次，我忘了带钥匙，她特意从公司给我送过来。”
						同一个人，用不同的眼光去看，瞬间就不一样。很多时候我们会对身边的人吹毛求疵，可如果一味盯着别人的缺点，生活自然一地鸡毛。只有看到对方的优点，才能舒服相处。
						朋友间如此，爱人间亦如此。越是优秀的人，越容易看到别人的好。 3
						有句话说，良言一句三冬暖，恶语伤人六月寒。说一句话，不过几秒钟的事，却可能会在很多年后仍旧影响着对方。
						有位网友分享过自己的经历，说自己高三时压力大到一度崩溃，没想到有位老师却夸她“很有潜力”。几十年过去了，她依然记得那个老师。也有网友吐槽说：“矫正牙齿前被别人说不要张嘴笑，导致现在还不敢在别人面前笑。”
						把握分寸，是一种难得的智慧。那些能看到别人优点的人，往往懂得把别人放在心上，时刻照顾别人的感受。他们会在一言一语中放低自己的姿态，让别人感受到关心和尊重。
						人与人之间，不过一场以心换心。学会欣赏别人，别人才会欣赏你。对他人适时地赞美，不需要多么高超的说话技巧，比技巧更重要的是真诚。真心实意、以诚相待，永远是人际交往中最基本的准则。
					</div>
				</v3-dialog>
			</v3-col>
		</v3-row>

		<v3-row>
			<v3-col>
				<h3>在弹窗关闭之前做一些处理：</h3>
			</v3-col>
		</v3-row>
		<v3-row>
			<v3-col>
				<v3-button type="primary" @click="state.showDialog6 = true"
					>打开弹窗</v3-button
				>
				<v3-dialog
					v-model="state.showDialog6"
					:headerActions="state.headerActions6"
					:beforeClose="handleBeforeClose6"
				>
					<div class="dialog-content-6">
						天下之患，最不可为者，名为治平无事，而其实有不测之忧，坐观其变，而不为之所，则恐至于不可救，起而强为之则天下狃于治平之安，而不吾信
						——《苏东坡 晁错论》
						大汉开国元勋淮阴侯韩信死于长乐钟室，年仅三十五岁。随后，韩信三族被诛，数千无辜，血染长安，哭号之声，传荡千古，当是时，寒风凛冽，长空飘雪，长安满城人尽嗟叹，无不悲怆，皆言淮阴侯一饭千金，不忘漂母；解衣推食，宁负汉皇？萧何一言便强入贺，欲谋逆者怎会坦率如斯？是侯不负汉，而汉忍于负侯，侯之死，冤乎哉！
						不日，蒯通被带到，高祖亲自审问。「当日汝与韩信之言，究竟为何？」
						蒯通道「吾相韩信，言其面不过封侯，背则贵不可言。因说之背汉自立，则可三分天下也。」
						高祖又问：「然信有何言？」 蒯通长叹一声道：
					</div>
				</v3-dialog>
			</v3-col>
		</v3-row>

		<v3-row>
			<v3-col>
				<h3>嵌套的弹窗：</h3>
			</v3-col>
		</v3-row>
		<v3-row>
			<v3-col>
				<v3-button type="primary" @click="state.showDialog7 = true"
					>打开弹窗</v3-button
				>
				<v3-dialog v-model="state.showDialog7">
					<div class="dialog-content-6">
						天下之患，最不可为者，名为治平无事，而其实有不测之忧，坐观其变，而不为之所，则恐至于不可救，起而强为之则天下狃于治平之安，而不吾信
						——《苏东坡 晁错论》
						大汉开国元勋淮阴侯韩信死于长乐钟室，年仅三十五岁。随后，韩信三族被诛，数千无辜，血染长安，哭号之声，传荡千古，当是时，寒风凛冽，长空飘雪，长安满城人尽嗟叹，无不悲怆，皆言淮阴侯一饭千金，不忘漂母；解衣推食，宁负汉皇？萧何一言<span
							style="color: rgba(0, 160, 255, 1); cursor: pointer"
							@click="state.showDialog8 = true"
							>查看全文</span
						>
					</div>
					<v3-dialog v-model="state.showDialog8">
						天下之患，最不可为者，名为治平无事，而其实有不测之忧，坐观其变，而不为之所，则恐至于不可救，起而强为之则天下狃于治平之安，而不吾信
						——《苏东坡 晁错论》
						大汉开国元勋淮阴侯韩信死于长乐钟室，年仅三十五岁。随后，韩信三族被诛，数千无辜，血染长安，哭号之声，传荡千古，当是时，寒风凛冽，长空飘雪，长安满城人尽嗟叹，无不悲怆，皆言淮阴侯一饭千金，不忘漂母；解衣推食，宁负汉皇？萧何一言便强入贺，欲谋逆者怎会坦率如斯？是侯不负汉，而汉忍于负侯，侯之死，冤乎哉！
						不日，蒯通被带到，高祖亲自审问。「当日汝与韩信之言，究竟为何？」
						蒯通道「吾相韩信，言其面不过封侯，背则贵不可言。因说之背汉自立，则可三分天下也。」
						高祖又问：「然信有何言？」 蒯通长叹一声道：
					</v3-dialog>
				</v3-dialog>
			</v3-col>
		</v3-row>
	</div>
</template>
<script lang="ts">
import { defineComponent, reactive } from 'vue';
import V3Message from '@components/message/src/components/MessageConstructor';

export default defineComponent({
	setup() {
		const state = reactive({
			showDialog1: false,
			showDialog2: false,
			radioValue2: 'male',
			selectValue2: 'beijing',
			selectOptions2: [
				{
					label: '北京',
					value: 'Beijing',
					disabled: false,
				},
				{
					label: '上海',
					value: 'Shanghai',
					disabled: true,
				},
				{
					label: '广州',
					value: 'Guangzhou',
					disabled: false,
				},
				{
					label: '深圳',
					value: 'Shenzhen',
					disabled: false,
				},
			],
			showDialog3: false,
			showDialog4: false,
			headerActions2: [
				{
					buttonProps: {
						type: 'default',
						loading: false,
						plain: true,
					},
					text: '取消',
					handler() {
						state.showDialog2 = false;
					},
				},
				{
					buttonProps: {
						type: 'success',
						loading: false,
					},
					text: '确定',
					handler() {
						state.headerActions2[1].buttonProps.loading = true;

						setTimeout(() => {
							state.headerActions2[1].buttonProps.loading = false;
						}, 1000);
					},
				},
			],
			showDialog5: false,
			showDialog6: false,
			showDialog7: false,
			showDialog8: false,
		});

		function handleConfirm4() {
			V3Message.success({
				message: '已确认',
			});

			state.showDialog4 = false;
		}

		function handleBeforeClose6(done: Function) {
			// 等待 3s 后关闭弹窗
			V3Message.danger({
				message: '等待3s后关闭弹窗',
				duration: 3000,
			});
			setTimeout(() => {
				done();
			}, 3000);
		}

		return {
			state,
			handleConfirm4,
			handleBeforeClose6,
		};
	},
	methods: {},
});
</script>
<style lang="scss"></style>
<style lang="scss" scoped>
.dialog-4 {
	.dialog-content-4 {
		display: flex;
		align-items: center;
		i.v3-icon {
			font-size: 20px;
			color: rgba(237, 170, 83, 1);
		}
		span {
			display: block;
			margin-left: 6px;
		}
	}
	.dialog-footer-4 {
		display: flex;
		justify-content: flex-end;
		:deep(.v3-button) {
			&:not(:first-child) {
				margin-left: 12px;
			}
		}
	}
}
</style>
